app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 2], ["author_name", "Post Guy"], ["body", "Absolutely agreed."], ["created_at", "2014-12-29 23:04:49.103803"], ["updated_at", "2014-12-29 23:04:49.103803"]]
---
    def create
      @comment = Comment.new(comment_params)
      @comment.article_id = params[:article_id]

      @comment.save