app/controllers/tags_controller.rb

    def destroy
        Tag.find(params[:id]).destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]